In [ ]:
# Import Libraries

In [1]:
import pandas as pd
import numpy as np
import os

# Products Data Frame

In [2]:
df_prods = pd.read_csv(r'/Users/pedropaulo/Desktop/Tasks CF/Instacart Basket Analysis/Data/Original Data/products.csv', index_col=False,sep=';')

In [3]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61.0,19.0,5.8
1,2,All-Seasons Salt,104.0,13.0,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94.0,7.0,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38.0,1.0,10.5
4,5,Green Chile Anytime Sauce,5.0,13.0,4.3

In [ ]:
# Product dataframe description

In [31]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49682.000000   49682.000000  49682.000000
mean   24844.345139     67.772835      11.727910      9.994803
std    14343.717401     38.314849       5.850292    453.569885
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [ ]:
# Finding Missing Values Products

In [14]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id         11
department_id    11
prices           11
dtype: int64

In [ ]:
# Finding Missing product_name Values

In [15]:
df_nan = df_prods[df_prods['product_name'].isnull()== True]

In [17]:
df_nan.head(16)

       product_id product_name  aisle_id  department_id  prices
33             34          NaN     121.0           14.0    12.2
68             69          NaN      26.0            7.0    11.8
115           116          NaN      93.0            3.0    10.8
261           262          NaN     110.0           13.0    12.1
525           525          NaN     109.0           11.0     1.2
1511         1511          NaN      84.0           16.0    14.3
1780         1780          NaN     126.0           11.0    12.3
2240         2240          NaN      52.0            1.0    14.2
2586         2586          NaN     104.0           13.0    12.4
3159         3159          NaN     126.0           11.0    13.1
3230         3230          NaN     120.0           16.0    14.4
3736         3736          NaN      41.0            8.0    14.8
4283         4283          NaN      77.0            7.0    14.4
4790         4790          NaN      91.0           16.0    14.5
38187       38183          NaN      39.0           12.0    20.9
40444       40440          NaN     120.0           16.0    14.8

In [18]:
# Cheking rows
df_prods.shape

(49693, 5)

In [ ]:
# Cleaning Missing Values in product_name

In [19]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [20]:
df_prods_clean

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61.0,19.0,5.8
1,2,All-Seasons Salt,104.0,13.0,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94.0,7.0,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38.0,1.0,10.5
4,5,Green Chile Anytime Sauce,5.0,13.0,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124.0,5.0,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42.0,1.0,3.1
49690,49686,Artisan Baguette,112.0,3.0,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41.0,8.0,4.7
49692,49688,Fresh Foaming Cleanser,73.0,11.0,13.5

In [ ]:
# Finding Duplicated

In [21]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [22]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70.0,11.0,4.8
18459,18458,Ranger IPA,27.0,5.0,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27.0,5.0,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121.0,14.0,6.8
35495,35491,Adore Forever Body Wash,127.0,11.0,9.9

In [23]:
# Checking Rows
df_prods_clean.shape

(49677, 5)

In [ ]:
# Cleaning duplicate

In [24]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [25]:
# Checking rows
df_prods_clean_no_dups.shape

(49672, 5)

In [ ]:
# Export product checked as csv.

In [30]:
df_prods_clean_no_dups.to_csv(r'/Users/pedropaulo/Desktop/Tasks CF/Instacart Basket Analysis/Data/Prepared Data/products_checked.csv')

# Orders_wrangled Data Frame

In [6]:
df_ords = pd.read_csv(r'/Users/pedropaulo/Desktop/Tasks CF/Instacart Basket Analysis/Data/Prepared Data/orders_wrangled.csv', index_col=False,sep=';')

In [7]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [ ]:
# Orders_wrangled Data Frame Description

In [8]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,1.048575e+06,1.048575e+06,1.048575e+06,1.048575e+06,1.048575e+06,985475.000000
mean,1.710968e+06,3.156404e+04,1.717418e+01,2.778637e+00,1.345229e+01,11.102506
std,9.875774e+05,1.816695e+04,1.771094e+01,2.047751e+00,4.219144e+00,9.186663
min,6.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000
25%,8.554670e+05,1.589600e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000
50%,1.710657e+06,3.160800e+04,1.100000e+01,3.000000e+00,1.300000e+01,7.000000
75%,2.566970e+06,4.729700e+04,2.300000e+01,5.000000e+00,1.600000e+01,15.000000
max,3.421083e+06,6.310000e+04,1.000000e+02,6.000000e+00,2.300000e+01,30.000000

In [ ]:
# Checking for mixed types in df_ords

In [26]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

In [ ]:
# No mix type was found

In [ ]:
# Finding missing Orders_wrangled values

In [27]:
df_ords.isnull().sum()

order_id                     0
user_id                      0
order_number                 0
orders_day_of_week           0
order_hour_of_day            0
days_since_last_order    63100
dtype: int64

I suppose there is a lot of missing data due to the fact that the column days_since_last_orders, represents the last order of the client and as many only placed one order, this data does not exist. So I think the best option is to keep it for future analysis, for example, if we need to understand why the clients made only one order.

In [ ]:
# Finding dulplicate Orders_wrangled values

In [28]:
df_dups = df_ords[df_ords.duplicated()]

In [29]:
df_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_last_order]
Index: []

In [ ]:
# No duplicate was found

# TEST

In [9]:
df_test = pd.DataFrame()

In [ ]:
# Create a mixed type columns

In [10]:
df_test['mix'] = ['a', 'b', 1, True]

In [ ]:
# Test Data Frame

In [11]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [ ]:
# Check for mixed types (TEST)

In [12]:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [13]:
df_test['mix'] = df_test['mix'].astype('str')